steiner-connolly/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Arduino Zero (Native USB Port)
# --------------------------------------
synthacon.name=Steiner-Connolly Synthacon
synthacon.vid.0=0x2341
synthacon.pid.0=0x804d
synthacon.vid.1=0x2341
synthacon.pid.1=0x004d
synthacon.vid.2=0x2341
synthacon.pid.2=0x824d
synthacon.vid.3=0x2341
synthacon.pid.3=0x024d
synthacon.upload_port.0.vid=0x2341
synthacon.upload_port.0.pid=0x804d
synthacon.upload_port.4.board=synthacon

synthacon.upload.tool=bossac
synthacon.upload.tool.default=bossac
synthacon.upload.protocol=sam-ba
synthacon.upload.maximum_size=65536
synthacon.upload.maximum_data_size=8192
synthacon.upload.use_1200bps_touch=true
synthacon.upload.wait_for_upload_port=true
synthacon.upload.native_usb=true
synthacon.build.mcu=cortex-m0plus
synthacon.build.f_cpu=48000000L
synthacon.build.usb_product="Synthacon"
synthacon.build.usb_manufacturer="Steiner-Connolly"
synthacon.build.board=SAMD_ZERO
synthacon.build.core=arduino
synthacon.build.extra_flags=-D__SAMD21G16A__ {build.usb_flags}
synthacon.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
synthacon.build.openocdscript=openocd_scripts/synthacon.cfg
synthacon.build.variant=synthacon
synthacon.build.variant_system_lib=
synthacon.build.vid=0x2341
synthacon.build.pid=0x804d
synthacon.bootloader.tool=openocd
synthacon.bootloader.tool.default=openocd
synthacon.bootloader.file=zero/samd21_sam_ba.bin